cf-src/Documents/СписаниеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СписаниеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf-src/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf-src/Documents/СписаниеТоваров/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Сообщить("Не заполнен реквизит 'Склад'.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если Товары.Количество() = 0 Тогда
		Сообщить("Документ не может быть записан без строк в табличной части 'Товары'.", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ЕстьДефицитОстатков(Склад) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Для каждого СтрокаТовара Из Товары Цикл
		
		Если СтрокаТовара.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = СтрокаТовара.Номенклатура;
		Движение.Склад = Склад;
		Движение.Количество = СтрокаТовара.Количество;
	
	КонецЦикла;

КонецПроцедуры

Функция ЕстьДефицитОстатков(СкладПроверки)

	ТаблицаТоваров = Товары.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.Количество) КАК КоличествоТребуется
	|ПОМЕСТИТЬ ВТТоварыДокумента
	|ИЗ
	|	&ТаблицаТоваров КАК Товары
	|СГРУППИРОВАТЬ ПО
	|	Товары.Номенклатура
	|;
	|
	|ВЫБРАТЬ
	|	ВТТоварыДокумента.Номенклатура КАК Номенклатура,
	|	ВТТоварыДокумента.КоличествоТребуется КАК КоличествоТребуется,
	|	ЕСТЬNULL(Остатки.КоличествоОстаток, 0) КАК КоличествоОстаток
	|ИЗ
	|	ВТТоварыДокумента КАК ВТТоварыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(&Момент,
	|			Склад = &Склад
	|				И Номенклатура В (ВЫБРАТЬ Номенклатура ИЗ ВТТоварыДокумента)) КАК Остатки
	|		ПО ВТТоварыДокумента.Номенклатура = Остатки.Номенклатура
	|ГДЕ
	|	ВТТоварыДокумента.КоличествоТребуется > ЕСТЬNULL(Остатки.КоличествоОстаток, 0)";
	
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Запрос.УстановитьПараметр("Момент", Дата);
	Запрос.УстановитьПараметр("Склад", СкладПроверки);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Сообщить("Невозможно провести списание: недостаточно товара на складе.", СтатусСообщения.Важное);
	
	Пока Истина Цикл
		Дефицит = Выборка.КоличествоТребуется - Выборка.КоличествоОстаток;
		Сообщить(
			СтрШаблон("Номенклатура '%1': требуется %2, остаток %3, дефицит %4.",
				Выборка.Номенклатура,
				Формат(Выборка.КоличествоТребуется, "ЧГ=15.3"),
				Формат(Выборка.КоличествоОстаток, "ЧГ=15.3"),
				Формат(Дефицит, "ЧГ=15.3")),
			СтатусСообщения.Важное);
		
		Если НЕ Выборка.Следующий() Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;

КонецФункции
